{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv1d_4/kernel", "shape": [5, 1, 30], "dtype": "float32"}, {"name": "conv1d_4/bias", "shape": [30], "dtype": "float32"}, {"name": "conv1d_5/kernel", "shape": [3, 30, 15], "dtype": "float32"}, {"name": "conv1d_5/bias", "shape": [15], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [2910, 128], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [128, 50], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [50, 25], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [25], "dtype": "float32"}]}]}